In [1]:
import MySQLdb

In [2]:
db = MySQLdb.connect(
    host="52.78.107.76",
    user="root",
    passwd="dss",
    db="world",
    charset="utf8")

db

In [3]:
Query = """
    Show Tables;
"""

In [4]:
curs = db.cursor()
curs.execute(Query)

10

### 1) 멕시코(Mexico)보다 인구가 많은 나라이름과 인구수를 조회하시고 인구수 순으로 내림차순하세요.

In [28]:
Query = """
     Select Name, Population
     From country
     Where Population > (Select Population
                            From country
                             Where Name = "Mexico")
    Order by Population DESC


"""

In [29]:
df = pd.read_sql(Query, db)

df

                 Name  Population
0               China  1277558000
1               India  1013662000
2       United States   278357000
3           Indonesia   212107000
4              Brazil   170115000
5            Pakistan   156483000
6  Russian Federation   146934000
7          Bangladesh   129155000
8               Japan   126714000
9             Nigeria   111506000

### 2) 국가별 몇개의 도시가 있는지 조회하고 도시수 순으로 10위까지 내림차순하세요.

In [52]:
Query = """
    Select country.Name, count(city.Name) as count
    From city
    Join country
    on city.CountryCode = country.Code
    Group by CountryCode
    Order by count DESC
    Limit 10
"""

In [53]:
df = pd.read_sql(Query, db)

df

                 Name  count
0               China    363
1               India    341
2       United States    274
3              Brazil    250
4               Japan    248
5  Russian Federation    189
6              Mexico    173
7         Philippines    136
8             Germany     93
9           Indonesia     85

### 3) 언어별 사용인구를 출력하고 언어 사용인구 순으로 10위까지 내림차순하세요.

In [76]:
Query = """
        Select countrylanguage.Language, sum(round(country.Population*countrylanguage.Percentage*0.01)) as sum
        From countrylanguage
        Join country
        on country.Code = countrylanguage.CountryCode
        Group by Language
        Order by sum DESC
        Limit 10

"""

In [77]:
df = pd.read_sql(Query, db)

df

     Language           sum
0     Chinese  1.191844e+09
1       Hindi  4.056331e+08
2     Spanish  3.550295e+08
3     English  3.470779e+08
4      Arabic  2.338392e+08
5     Bengali  2.093047e+08
6  Portuguese  1.775953e+08
7     Russian  1.608076e+08
8    Japanese  1.268141e+08
9     Punjabi  1.040254e+08

### 4) 나라 전체 인구의 10%이상인 도시에서 도시인구가 500만이 넘는 도시를 아래와 같이 조회 하세요.

In [104]:
Query = """
    Select city.name, city.CountryCode, country.name, (round((city.Population/country.Population*100), 2)) as percentage 
    From country
    Join (Select *
        From city
        Where Population >= 5000000) as city
    ON country.Code = city.CountryCode
    Where city.Population >= country.Population*0.1 
    Order by Percentage DESC

"""

In [105]:
df = pd.read_sql(Query, db)
df

                Name CountryCode            name  percentage
0               Lima         PER            Peru       25.19
1              Seoul         KOR     South Korea       21.31
2  Santafé de Bogotá         COL        Colombia       14.79
3           Istanbul         TUR          Turkey       13.20
4             London         GBR  United Kingdom       12.22
5            Bangkok         THA        Thailand       10.29